{
  "backend/main.mo": "Main actor implementing user profile management and test results CRUD operations with role-based access control (admin-only create/update/delete, users can view their own results).",
  "backend/migration.mo": "Migration module that transforms old test result schema (studentName, testName, score, date, subject) to new schema (examName, examDate, totalMarks, percentage, rank, globalRank, hasAttachment).",
  "feature_evidence.json": "Feature evidence report documenting implemented features including tabular test exam report UI, admin CRUD interface, date sorting, and total/percentage formatting with associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, hooks, and utilities for test results management, authentication, and admin functionality.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes with educational color palette.",
  "frontend/index.html": "HTML entry point for the Guru Kirpa application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component managing authentication flow, view routing (dashboard/report/admin), profile setup, and conditional rendering based on user state.",
  "frontend/src/components/AdminTestResultsPage.tsx": "Admin-only page for managing student test results with principal-based student selection, sortable table display, and add/edit/delete operations with role verification.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright information and Caffeine.ai attribution link with UTM tracking parameters.",
  "frontend/src/components/Header.tsx": "Header component displaying the Guru Kirpa logo, user profile info, admin navigation button (for admin users), and login/logout button. Provides navigation callbacks for dashboard, report, and admin views.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button component that uses Internet Identity authentication. Handles login state, displays appropriate icons and text, and clears query cache on logout.",
  "frontend/src/components/LoginScreen.tsx": "Landing page shown to unauthenticated users, displaying welcome message and four feature cards (View Results, Track Performance, Detailed Insights, Secure Access) with icons.",
  "frontend/src/components/ProfileSetup.tsx": "Profile setup form for new users to enter their name after authentication. Displays a card with user icon and saves profile using the useSaveCallerUserProfile hook.",
  "frontend/src/components/TestExamReportPage.tsx": "Full-page table view of all test results with blue header, back button, and columns for exam name/date, total marks, percentage, rank, and global rank. Sorts results by date (most recent first) and formats timestamps.",
  "frontend/src/components/TestResultCard.tsx": "Empty file with no content.",
  "frontend/src/components/TestResultForm.tsx": "Dialog form for creating or editing test results with fields for exam name, date, marks, percentage, rank, global rank, and attachment flag. Validates input and converts dates to nanosecond timestamps.",
  "frontend/src/components/TestResultsDashboard.tsx": "Student dashboard showing total test count and a prominent button to navigate to the Test Exam Report page. Displays loading skeleton and error states.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Initializes access control with admin token and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useCreateTestResult.ts": "React Query mutation hook for creating test results for a student. Invalidates test results queries on success to refresh the UI.",
  "frontend/src/hooks/useDeleteTestResult.ts": "React Query mutation hook for deleting a test result for a specific student and exam, invalidating related queries on success.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook that fetches the current user's profile from the backend, with custom loading state handling for actor dependency.",
  "frontend/src/hooks/useGetCallerUserRole.ts": "React Query hook that fetches the current user's role, defaulting to 'guest' if actor is unavailable.",
  "frontend/src/hooks/useGetTestResults.ts": "React Query hook that fetches all test results from the backend, returning an empty array if actor is unavailable.",
  "frontend/src/hooks/useGetTestResultsFor.ts": "React Query hook that fetches test results for a specific student Principal, enabled only when both actor and student are available.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Barrel export file that re-exports all React Query hooks for backend operations including user profiles, test results, and CRUD operations.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "React Query mutation hook for saving the current user's profile, invalidating the profile query cache on success.",
  "frontend/src/hooks/useUpdateTestResult.ts": "React Query mutation hook for updating a test result for a specific student and exam, invalidating related queries on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, rendering the root App component.",
  "frontend/src/utils/formatTestResult.ts": "Utility functions for parsing and formatting test result data including total marks parsing, percentage calculation, and global rank formatting.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, container settings, custom animations, and typography plugins.",
  "project_state.json": "Project state file for Guru Kirpa coaching institute app tracking 7 implemented features including student authentication, test results display, dashboard interface with greeting/profile, promotional GSAT banner, and navigation cards. Defines architectural requirements for multi-user system with student login and admin interface for managing test results in tabular format."
}